dimitarm1/stm_flash_prj/STM32F0_Discovery_IO_Toggle/src/main.c
	switch (level) {
	case 0:

		break;
	case 1:
		GPIOA->BSRR = GPIO_BSRR_BS8 ;
		GPIOC->BSRR = GPIO_BSRR_BS10;
		break;
	case 2:
		GPIOA->BSRR = GPIO_BSRR_BS8 | GPIO_BSRR_BS11 | GPIO_BSRR_BS12 ;
		GPIOC->BSRR = GPIO_BSRR_BS10;
		break;
	case 3:
		GPIOA->BSRR = GPIO_BSRR_BS8 | GPIO_BSRR_BS11 | GPIO_BSRR_BS12 ;
		GPIOC->BSRR = GPIO_BSRR_BS6 | GPIO_BSRR_BS7 |GPIO_BSRR_BS10;
		break;
	case 4:
		GPIOA->BSRR = GPIO_BSRR_BS8 | GPIO_BSRR_BS11 | GPIO_BSRR_BS12 ;
		GPIOB->BSRR = GPIO_BSRR_BS12 | GPIO_BSRR_BS13;
		GPIOC->BSRR = GPIO_BSRR_BS6 | GPIO_BSRR_BS7 |GPIO_BSRR_BS10;
		break;
	case 5:
		GPIOA->BSRR = GPIO_BSRR_BS8 | GPIO_BSRR_BS11 | GPIO_BSRR_BS12 ;
		GPIOB->BSRR = GPIO_BSRR_BS4 |GPIO_BSRR_BS12 | GPIO_BSRR_BS13;
		GPIOC->BSRR = GPIO_BSRR_BS6 | GPIO_BSRR_BS7 |GPIO_BSRR_BS10;
		GPIOF->BSRR = GPIO_BSRR_BS4 ;
		break;
	case 6:
		GPIOA->BSRR = GPIO_BSRR_BS8 | GPIO_BSRR_BS11 | GPIO_BSRR_BS12 ;
		GPIOB->BSRR = GPIO_BSRR_BS4 |GPIO_BSRR_BS12 | GPIO_BSRR_BS13 | GPIO_BSRR_BS14;
		GPIOC->BSRR = GPIO_BSRR_BS6 | GPIO_BSRR_BS7 |GPIO_BSRR_BS10;
		GPIOF->BSRR = GPIO_BSRR_BS4 | GPIO_BSRR_BS5;
		break;
	case 7:
		GPIOA->BSRR = GPIO_BSRR_BS8 | GPIO_BSRR_BS11 | GPIO_BSRR_BS12 ;
		GPIOB->BSRR = GPIO_BSRR_BS4 |GPIO_BSRR_BS12 | GPIO_BSRR_BS13 | GPIO_BSRR_BS14;
		GPIOC->BSRR = GPIO_BSRR_BS6 | GPIO_BSRR_BS7 |GPIO_BSRR_BS10 | GPIO_BSRR_BS15;
		GPIOF->BSRR = GPIO_BSRR_BS0 | GPIO_BSRR_BS4 | GPIO_BSRR_BS5;
		break;
	case 8:
		GPIOA->BSRR = GPIO_BSRR_BS8 | GPIO_BSRR_BS11 | GPIO_BSRR_BS12 ;
		GPIOB->BSRR = GPIO_BSRR_BS4 |GPIO_BSRR_BS12 | GPIO_BSRR_BS13 | GPIO_BSRR_BS14 | GPIO_BSRR_BS15;
		GPIOC->BSRR = GPIO_BSRR_BS4 | GPIO_BSRR_BS6 | GPIO_BSRR_BS7 |GPIO_BSRR_BS10 | GPIO_BSRR_BS15;
		GPIOF->BSRR = GPIO_BSRR_BS0 | GPIO_BSRR_BS4 | GPIO_BSRR_BS5;
		break;
	case 9:
		GPIOA->BSRR = GPIO_BSRR_BS8 | GPIO_BSRR_BS11 | GPIO_BSRR_BS12 ;
		GPIOB->BSRR = GPIO_BSRR_BS4 |GPIO_BSRR_BS0 | GPIO_BSRR_BS12 | GPIO_BSRR_BS13 | GPIO_BSRR_BS14 | GPIO_BSRR_BS15;
		GPIOC->BSRR = GPIO_BSRR_BS4 | GPIO_BSRR_BS5 | GPIO_BSRR_BS6 | GPIO_BSRR_BS7 |GPIO_BSRR_BS10 | GPIO_BSRR_BS15;
		GPIOF->BSRR = GPIO_BSRR_BS0 | GPIO_BSRR_BS4 | GPIO_BSRR_BS5;
		break;
	case 0x0A:
		GPIOA->BSRR = GPIO_BSRR_BS8 | GPIO_BSRR_BS11 | GPIO_BSRR_BS12 ;
		GPIOB->BSRR = GPIO_BSRR_BS4 |GPIO_BSRR_BS0 | GPIO_BSRR_BS1 | GPIO_BSRR_BS2 | GPIO_BSRR_BS12 | GPIO_BSRR_BS13 | GPIO_BSRR_BS14 | GPIO_BSRR_BS15 ;
		GPIOC->BSRR = GPIO_BSRR_BS4 | GPIO_BSRR_BS5 | GPIO_BSRR_BS6 | GPIO_BSRR_BS7 | GPIO_BSRR_BS10 | GPIO_BSRR_BS15;
		GPIOF->BSRR = GPIO_BSRR_BS0 | GPIO_BSRR_BS4 | GPIO_BSRR_BS5;
		break;
	}
}

void show_digit(int digit){
	digit = digit & 0x0F;
	//Digits and bars
	GPIOA->BRR = GPIO_BRR_BR4 | GPIO_BRR_BR5 | GPIO_BRR_BR8 | GPIO_BRR_BR11 | GPIO_BRR_BR12;
	GPIOB->BRR = GPIO_BRR_BR0 | GPIO_BRR_BR1 | GPIO_BRR_BR2 | GPIO_BRR_BR4 | GPIO_BRR_BR12 | GPIO_BRR_BR13 | GPIO_BRR_BR14 | GPIO_BRR_BR15;
	GPIOC->BRR = GPIO_BRR_BR4 | GPIO_BRR_BR5 | GPIO_BRR_BR6 | GPIO_BRR_BR7 | GPIO_BRR_BR10 | GPIO_BRR_BR15 ;
	GPIOF->BRR = GPIO_BRR_BR0 | GPIO_BRR_BR4 | GPIO_BRR_BR5;

	// LEDs and bars
	GPIOA->BRR = GPIO_BRR_BR8 | GPIO_BRR_BR11 | GPIO_BRR_BR12;
	GPIOC->BRR = GPIO_BRR_BR10;
	if(flash_mode == 3 && (flash_counter & 0x100)) return;
	switch (digit) {
	case 0:
		GPIOA->BSRR = GPIO_BSRR_BS4 | GPIO_BSRR_BS5 ;
		GPIOB->BSRR = GPIO_BSRR_BS1 | GPIO_BSRR_BS2 | GPIO_BSRR_BS4 | GPIO_BSRR_BS12 | GPIO_BSRR_BS13 | GPIO_BSRR_BS14 | GPIO_BSRR_BS15;
		GPIOC->BSRR = GPIO_BSRR_BS4 | GPIO_BSRR_BS6 | GPIO_BSRR_BS7 ;
		GPIOF->BSRR = GPIO_BSRR_BS4 | GPIO_BSRR_BS5;

		break;
	case 1:
		GPIOA->BSRR = 0;
		GPIOB->BSRR = GPIO_BSRR_BS4 | GPIO_BSRR_BS12 | GPIO_BSRR_BS13;
		GPIOC->BSRR = 0;
		GPIOF->BSRR = GPIO_BSRR_BS4 ;
		break;
	case 2:
		GPIOA->BSRR = GPIO_BSRR_BS4 | GPIO_BSRR_BS5  ;
		GPIOB->BSRR = GPIO_BSRR_BS0 | GPIO_BSRR_BS1 | GPIO_BSRR_BS2 | GPIO_BSRR_BS4 | GPIO_BSRR_BS14;
		GPIOC->BSRR = GPIO_BSRR_BS5 | GPIO_BSRR_BS6 | GPIO_BSRR_BS7 ;
		GPIOF->BSRR = GPIO_BSRR_BS4 | GPIO_BSRR_BS5;
		break;
	case 3:
		GPIOA->BSRR = GPIO_BSRR_BS4 | GPIO_BSRR_BS5 ;
		GPIOB->BSRR = GPIO_BSRR_BS0 | GPIO_BSRR_BS1 | GPIO_BSRR_BS2 | GPIO_BSRR_BS4 | GPIO_BSRR_BS12 | GPIO_BSRR_BS13 | GPIO_BSRR_BS14;
		GPIOC->BSRR = GPIO_BSRR_BS5 ;
		GPIOF->BSRR = GPIO_BSRR_BS4 | GPIO_BSRR_BS5;
		break;
	case 4:
		GPIOA->BSRR = GPIO_BSRR_BS4 | GPIO_BSRR_BS5 ;
		GPIOB->BSRR = GPIO_BSRR_BS0 | GPIO_BSRR_BS4 | GPIO_BSRR_BS12 | GPIO_BSRR_BS13 | GPIO_BSRR_BS15;
		GPIOC->BSRR = GPIO_BSRR_BS4 | GPIO_BSRR_BS5 ;
		GPIOF->BSRR = GPIO_BSRR_BS4;
		break;
	case 5:
		GPIOA->BSRR = GPIO_BSRR_BS4 | GPIO_BSRR_BS5  ;
		GPIOB->BSRR = GPIO_BSRR_BS0 | GPIO_BSRR_BS1 | GPIO_BSRR_BS2 | GPIO_BSRR_BS12 | GPIO_BSRR_BS13 | GPIO_BSRR_BS14 | GPIO_BSRR_BS15;
		GPIOC->BSRR = GPIO_BSRR_BS4 | GPIO_BSRR_BS5;
		GPIOF->BSRR = GPIO_BSRR_BS5;
		break;
	case 6:
		GPIOA->BSRR = GPIO_BSRR_BS4 | GPIO_BSRR_BS5  ;
		GPIOB->BSRR = GPIO_BSRR_BS0 | GPIO_BSRR_BS1 | GPIO_BSRR_BS2 | GPIO_BSRR_BS12 | GPIO_BSRR_BS13 | GPIO_BSRR_BS14 | GPIO_BSRR_BS15;
		GPIOC->BSRR = GPIO_BSRR_BS4 | GPIO_BSRR_BS5 | GPIO_BSRR_BS6 | GPIO_BSRR_BS7 ;
		GPIOF->BSRR = GPIO_BSRR_BS5;
		break;
	case 7:
		GPIOA->BSRR = GPIO_BSRR_BS4 | GPIO_BSRR_BS5  ;
		GPIOB->BSRR = GPIO_BSRR_BS4 | GPIO_BSRR_BS12 | GPIO_BSRR_BS13 | GPIO_BSRR_BS14;
		GPIOC->BSRR = 0;
		GPIOF->BSRR = GPIO_BSRR_BS4 | GPIO_BSRR_BS5;
		break;
	case 8:
		GPIOA->BSRR = GPIO_BSRR_BS4 | GPIO_BSRR_BS5  ;
		GPIOB->BSRR = GPIO_BSRR_BS0 | GPIO_BSRR_BS1 | GPIO_BSRR_BS2 | GPIO_BSRR_BS4 | GPIO_BSRR_BS12 | GPIO_BSRR_BS13 | GPIO_BSRR_BS14 | GPIO_BSRR_BS15;
		GPIOC->BSRR = 0 | GPIO_BSRR_BS4 | GPIO_BSRR_BS5 | GPIO_BSRR_BS6 | GPIO_BSRR_BS7 ;
		GPIOF->BSRR = GPIO_BSRR_BS4 | GPIO_BSRR_BS5;
		break;
	case 9:
		GPIOA->BSRR = GPIO_BSRR_BS4 | GPIO_BSRR_BS5  ;
		GPIOB->BSRR = GPIO_BSRR_BS0 | GPIO_BSRR_BS1 | GPIO_BSRR_BS2 | GPIO_BSRR_BS4 | GPIO_BSRR_BS12 | GPIO_BSRR_BS13 | GPIO_BSRR_BS14 | GPIO_BSRR_BS15;
		GPIOC->BSRR = 0 | GPIO_BSRR_BS4 | GPIO_BSRR_BS5 ;
		GPIOF->BSRR = GPIO_BSRR_BS4 | GPIO_BSRR_BS5;
		break;
	case 0x0A:
		GPIOA->BSRR = GPIO_BSRR_BS4 | GPIO_BSRR_BS5  ;
		GPIOB->BSRR = GPIO_BSRR_BS0 | GPIO_BSRR_BS4 | GPIO_BSRR_BS12 | GPIO_BSRR_BS13 | GPIO_BSRR_BS14 | GPIO_BSRR_BS15;
		GPIOC->BSRR = 0 | GPIO_BSRR_BS4 | GPIO_BSRR_BS5 | GPIO_BSRR_BS6 | GPIO_BSRR_BS7 ;
		GPIOF->BSRR = GPIO_BSRR_BS4 | GPIO_BSRR_BS5;
		break;
	case 0x0B:
		GPIOA->BSRR = GPIO_BSRR_BS4 | GPIO_BSRR_BS5  ;
		GPIOB->BSRR = GPIO_BSRR_BS0 | GPIO_BSRR_BS1 | GPIO_BSRR_BS2 | GPIO_BSRR_BS12 | GPIO_BSRR_BS13 | GPIO_BSRR_BS15;
		GPIOC->BSRR = GPIO_BSRR_BS4 | GPIO_BSRR_BS5 | GPIO_BSRR_BS6 | GPIO_BSRR_BS7 ;
		GPIOF->BSRR = 0 ;
		break;
	case 0x0C:
		GPIOA->BSRR = GPIO_BSRR_BS4 | GPIO_BSRR_BS5  ;
		GPIOB->BSRR = GPIO_BSRR_BS1 | GPIO_BSRR_BS2 | GPIO_BSRR_BS14 | GPIO_BSRR_BS15;
		GPIOC->BSRR = GPIO_BSRR_BS4 | GPIO_BSRR_BS6 | GPIO_BSRR_BS7 ;
		GPIOF->BSRR = GPIO_BSRR_BS5;
		break;
	case 0x0D:
		GPIOA->BSRR = GPIO_BSRR_BS4 | GPIO_BSRR_BS5  ;
		GPIOB->BSRR = GPIO_BSRR_BS0 | GPIO_BSRR_BS1 | GPIO_BSRR_BS2 | GPIO_BSRR_BS4 | GPIO_BSRR_BS12 | GPIO_BSRR_BS13;
		GPIOC->BSRR = GPIO_BSRR_BS5 | GPIO_BSRR_BS6 | GPIO_BSRR_BS7 ;
		GPIOF->BSRR = GPIO_BSRR_BS4;
		break;
	case 0x0E:
		GPIOA->BSRR = GPIO_BSRR_BS4 | GPIO_BSRR_BS5  ;
		GPIOB->BSRR = GPIO_BSRR_BS0 | GPIO_BSRR_BS1 | GPIO_BSRR_BS2 | GPIO_BSRR_BS14 | GPIO_BSRR_BS15;
		GPIOC->BSRR = GPIO_BSRR_BS4 | GPIO_BSRR_BS5 | GPIO_BSRR_BS6 | GPIO_BSRR_BS7 ;
		GPIOF->BSRR = GPIO_BSRR_BS5;
		break;
	case 0x0F:
	default:
		//empty
		//                GPIOA->BSRR = GPIO_BSRR_BS3 ;
		//                GPIOB->BSRR = GPIO_BSRR_BS0 | GPIO_BSRR_BS1 | GPIO_BSRR_BS2 | GPIO_BSRR_BS10 | GPIO_BSRR_BS11;
		//                GPIOC->BSRR = GPIO_BSRR_BS5;
		//                GPIOF->BSRR = GPIO_BSRR_BS4;
		break;
	}
}

