dimitarm1/stm_flash_prj/STM32F0_Discovery_IO_Toggle/src/main.c
void set_fan1(int value){
	//
//	uint32 counter = 0xFFFFFFF;
	uint32_t tim_base=7;
	TIM_Cmd(TIM2, DISABLE);

	zero_crossed = 0;
//	while (!zero_crossed && (counter--));
	switch(value){
	case 10:
		tim_base = 60; //Reverse polarity
		break;
	case 9:
		tim_base = 32;
		break;
	case 8:
		tim_base = 36;
		break;
	case 7:
		tim_base = 40;
		break;
	case 6:
		tim_base = 45;
		break;
	case 5:
		tim_base = 50;
		break;
	case 4:
		tim_base = 55;
		break;
	case 3:
		tim_base = 60;
		break;
	case 2:
		tim_base = 65;
		break;
	case 1:
	default:
		tim_base = 70;
		break;
	}
	if(value == 10) TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_Low;
	else  TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;
	TIM_TimeBaseStructure.TIM_Period = tim_base;
	TIM_TimeBaseInit(TIM2, &TIM_TimeBaseStructure);

	/* TIM2 PWM2 Mode configuration: Channel4 */
	//for one pulse mode set PWM2, output enable, pulse (1/(t_wanted=TIM_period-TIM_Pulse)), set polarity high
	if (value)	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
	else 	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Disable;
	if (TIM_TimeBaseStructure.TIM_Period) TIM_OCInitStructure.TIM_Pulse = TIM_TimeBaseStructure.TIM_Period-5;
	else  TIM_OCInitStructure.TIM_Pulse = 9;

	TIM_OC4Init(TIM2, &TIM_OCInitStructure);
//	if (value) TIM_Cmd(TIM2, ENABLE);
//	else TIM_Cmd(TIM2, DISABLE);
	TIM_Cmd(TIM2, ENABLE);
}

void set_aquafresh(int value){

	if (value)	GPIOB->BSRR = GPIO_BSRR_BS5;
	else GPIOB->BRR = GPIO_BSRR_BS5;
}

void set_volume(int value){
#ifdef PCBVERSION_2
	GPIOC->BRR = GPIO_BSRR_BS2 | GPIO_BSRR_BS3;
	if (value >8)	{
		GPIOC->BSRR = GPIO_BSRR_BS2 | GPIO_BSRR_BS3;
	}
	else if (value >5)	{
		GPIOC->BSRR =  GPIO_BSRR_BS3;
	}
	else if (value >2)	{
		GPIOC->BSRR = GPIO_BSRR_BS2 ;
	}

#else  //PCBVERSION_3
	GPIOB->BRR = GPIO_BRR_BR6;
	GPIOF->BRR = GPIO_BRR_BR6 | GPIO_BRR_BR7;

	if (value >9)	{
		//GPIOB->BSRR = GPIO_BSRR_BS6;
		//GPIOF->BSRR = GPIO_BSRR_BS6 ;
		//GPIOF->BSRR = GPIO_BSRR_BS7;
	}
	else if (value >7)	{
		GPIOB->BSRR = GPIO_BSRR_BS6;
		//GPIOF->BSRR = GPIO_BSRR_BS6 ;
		//GPIOF->BSRR = GPIO_BSRR_BS7;
	}
	else if (value >6)	{
		//GPIOB->BSRR = GPIO_BSRR_BS6;
		//GPIOF->BSRR = GPIO_BSRR_BS6 ;
		GPIOF->BSRR = GPIO_BSRR_BS7;
	}
	else if (value >5)	{
		GPIOB->BSRR = GPIO_BSRR_BS6;
		//GPIOF->BSRR = GPIO_BSRR_BS6 ;
		GPIOF->BSRR = GPIO_BSRR_BS7;
		}
	else if (value >4)	{
		//GPIOB->BSRR = GPIO_BSRR_BS6;
		GPIOF->BSRR = GPIO_BSRR_BS6 ;
		//GPIOF->BSRR = GPIO_BSRR_BS7;
		}
	else if (value >3)	{
		GPIOB->BSRR = GPIO_BSRR_BS6;
		GPIOF->BSRR = GPIO_BSRR_BS6 ;
		//GPIOF->BSRR = GPIO_BSRR_BS7;
		}
	else if (value >1)	{
		//GPIOB->BSRR = GPIO_BSRR_BS6;
		GPIOF->BSRR = GPIO_BSRR_BS6 ;
		GPIOF->BSRR = GPIO_BSRR_BS7;
		}
	else {
		GPIOB->BSRR = GPIO_BSRR_BS6;
		GPIOF->BSRR = GPIO_BSRR_BS6 ;
		GPIOF->BSRR = GPIO_BSRR_BS7;
	}
#endif
}


void usart_receive(void){
	useUart = 1;
	enum rxstates {rx_state_none, rx_state_pre_time, rx_state_main_time, rx_state_cool_time, rx_state_get_checksum};
	//	USART_ITConfig(USART1,USART_IT_RXNE,DISABLE);
	data =  USART_ReceiveData(USART1);

	//pre_time_sent = 0, main_time_sent = 0, cool_time_sent = 0;

	if ((data & 0x80)){
		// Command
		if((data & (0x0fU<<3U)) == ((controller_address & 0x0fU)<<3U)){
			Gv_UART_Timeout = 1500;
		}
		if((data == (0x80U | ((controller_address & 0x0fU)<<3U)))){
			data = (curr_status<<6)| ToBCD(curr_time);
//			data = (STATUS_WORKING<<6)|4;
			USART_SendData(USART1,data);
		}
		else if (data == ((0x80U | ((controller_address & 0x0fU)<<3U) ))+1) //Command 1 - Start
		{
			pre_time = 0;
			update_status();
		}
		else if (data == ((0x80U | ((controller_address & 0x0fU)<<3U) ))+2)  //Command 2 == Pre_time_set
		{
			rx_state = rx_state_pre_time;
		}
		else if (data == ((0x80U | ((controller_address & 0x0fU)<<3U)))+5) //Command 5 == Main_time_set
		{
			rx_state = rx_state_main_time;
		}
		else if (data == ((0x80U | ((controller_address & 0x0fU)<<3U)))+3) //Command 3 == Cool_time_set
		{
			rx_state = rx_state_cool_time;
		}

	} else if (rx_state){
		// payload
		int time_in_hex = ToBCD(main_time_sent);
		if(rx_state == rx_state_get_checksum){
			int checksum = (pre_time_sent + cool_time_sent  - time_in_hex - 5) & 0x7F;
			if(	data == checksum){
				pre_time = pre_time_sent;
				main_time = main_time_sent;
				cool_time = cool_time_sent;
				update_status();
				Gv_miliseconds = 0;
			}
			rx_state = 0;
		}
		if(rx_state == rx_state_pre_time){
			pre_time_sent = data;
			rx_state = 0;
		}
		if(rx_state == rx_state_main_time){
			main_time_sent = FromBCD(data);
			rx_state = 0;
		}
		if(rx_state == rx_state_cool_time){
			cool_time_sent = data;
			rx_state = rx_state_get_checksum;
			int checksum = (pre_time_sent + cool_time_sent  - time_in_hex - 5) & 0x7F;
			data = checksum;
			USART_SendData(USART1,data);
		}


	}
	//	USART_ITConfig(USART1,USART_IT_RXNE,ENABLE);
	//	USART_SendData(USART1,0x80);
}

void play_message(int index){

	disk_initialize(0);
	if(disk_status(0) == STA_NOINIT) return;
	dac_ping_pong_state = 0;
	dac_current_message = index;
	DRESULT result;
	dac_out_counter = 0;

	result = disk_read(0, &dac_buffer[dac_ping_pong_state], message_sector_offset[index], 2) ;
	dac_current_block = 0;

	dac_ping_pong_state = 0;
	dac_prev_ping_pong_state = dac_ping_pong_state;
	dac_fade_in_counter =  100;
	if (result) dac_out_counter = dac_out_counter;
	//DAC_Cmd(DAC_Channel_1, ENABLE);
	TIM6->DIER |= TIM_DIER_UIE; // Enable interrupt on update event
	TIM_Cmd(TIM6, ENABLE);
	TIM_Cmd(TIM14, ENABLE);
//	TIM6->CR1 |= TIM_CR1_CEN;

}




void TIM6_DAC_IRQHandler() {
	if((TIM6->SR & TIM_SR_UIF) != 0) // If update flag is set
	{
//		static int dummy = 0;
//		if (!dummy) dummy = 255;
//		else dummy = 0;
//		DAC_SetChannel1Data(DAC_Align_8b_R, dummy);
//		goto finish_TIM6_isr;

		if(dac_fade_in_counter){
			dac_fade_in_counter--;
			if(!(dac_fade_in_counter%100)){
				set_volume(dac_fade_in_counter/10);
			}
			if(!dac_fade_in_counter){
				GPIOC->BSRR =  GPIO_BSRR_BS3; // External sound
			}
			goto finish_TIM6_isr;
		}

		if(dac_fade_out_counter){
			GPIOC->BRR =  GPIO_BRR_BR3; // Internal sound

			dac_fade_out_counter--;
			if(!(dac_fade_out_counter%100)){
				set_volume(10 - dac_fade_out_counter/10);
			}
			if(!dac_fade_out_counter<=0){
				//TIM6->DIER &= ~TIM_DIER_UIE; // Disable interrupt on update event
				TIM_Cmd(TIM6, DISABLE);
				TIM_Cmd(TIM14, DISABLE);
				//DAC_Cmd(DAC_Channel_1, DISABLE);

			}
			goto finish_TIM6_isr;
		}
		unsigned char vol = 10-volume_message%10;
		TIM_SetCompare1(TIM14, dac_buffer[dac_ping_pong_state][dac_out_counter]/vol);

		if(dac_out_counter<512){
			dac_out_counter++;
		} else {
			dac_out_counter = 0;
			dac_ping_pong_state = !dac_ping_pong_state;

			if (dac_current_block < message_sector_counts[dac_current_message]){
				//disk_read(0, &dac_buffer[dac_ping_pong_state], message_sector_offset[dac_current_message] + dac_current_block, 2) ;
			} else if (dac_current_block > message_sector_counts[dac_current_message]){
				dac_fade_out_counter = 100;
			}
			dac_current_block++;

		}
	}
	finish_TIM6_isr:
	TIM6->SR &= ~TIM_SR_UIF; // Interrupt has been handled }
}




/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
